; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-5-3-263)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p4-0 - location
	p4-2 - location
	p5-2 - location
	p5-3 - location
	p5-4 - location
	p1-5 - location
	p3-1 - location
	p0-1 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s0)
	(at driver3 s3)
	(at driver4 s4)
	(at truck1 s4)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s2)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s0)
	(at package2 s3)
	(at package3 s0)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 19)
	(= (time-to-walk p4-0 s4) 19)
	(= (time-to-walk s0 p4-0) 3)
	(= (time-to-walk p4-0 s0) 3)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(= (time-to-walk s4 p4-2) 44)
	(= (time-to-walk p4-2 s4) 44)
	(= (time-to-walk s2 p4-2) 18)
	(= (time-to-walk p4-2 s2) 18)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(= (time-to-walk s5 p5-2) 5)
	(= (time-to-walk p5-2 s5) 5)
	(= (time-to-walk s2 p5-2) 91)
	(= (time-to-walk p5-2 s2) 91)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 65)
	(= (time-to-walk p5-3 s5) 65)
	(= (time-to-walk s3 p5-3) 90)
	(= (time-to-walk p5-3 s3) 90)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 63)
	(= (time-to-walk p5-4 s5) 63)
	(= (time-to-walk s4 p5-4) 79)
	(= (time-to-walk p5-4 s4) 79)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 70)
	(= (time-to-walk p1-5 s1) 70)
	(= (time-to-walk s5 p1-5) 86)
	(= (time-to-walk p1-5 s5) 86)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 88)
	(= (time-to-walk p3-1 s3) 88)
	(= (time-to-walk s1 p3-1) 79)
	(= (time-to-walk p3-1 s1) 79)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 56)
	(= (time-to-walk p0-1 s0) 56)
	(= (time-to-walk s1 p0-1) 76)
	(= (time-to-walk p0-1 s1) 76)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 44)
	(= (time-to-drive s0 s3) 44)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 22)
	(= (time-to-drive s3 s2) 22)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 65)
	(= (time-to-drive s4 s2) 65)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 58)
	(= (time-to-drive s0 s4) 58)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 83)
	(= (time-to-drive s5 s4) 83)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 69)
	(= (time-to-drive s2 s0) 69)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 6)
	(= (time-to-drive s1 s5) 6)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 69)
	(= (time-to-drive s3 s5) 69)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 54)
	(= (time-to-drive s0 s1) 54)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 79)
	(= (time-to-drive s2 s1) 79)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 66)
	(= (time-to-drive s4 s1) 66)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s2)
	(at driver3 s2)
	(at truck2 s1)
	(at package1 s4)
	(at package2 s0)
	(at package3 s1)
	))

(:metric minimize (+ (* 2 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver4 truck1 s4)
   deleted: (at driver4 s4) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 1 of 6
2. (drive-truck truck1 s4 s0 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (fuel-used) from 0 to 580
   goals met: 1 of 6
3. (load-truck package1 truck1 s0)
   deleted: (at package1 s0)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 6
4. (load-truck package3 truck1 s0)
   deleted: (at package3 s0)
   added: (in package3 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 1 of 6
5. (drive-truck truck1 s0 s3 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (fuel-used) from 580 to 1152
   goals met: 1 of 6
6. (load-truck package2 truck1 s3)
   deleted: (at package2 s3)
   added: (in package2 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 1 of 6
7. (drive-truck truck1 s3 s0 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (fuel-used) from 1152 to 1856
   goals met: 1 of 6
8. (unload-truck package2 truck1 s0)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 2 of 6
9. (disembark-truck driver4 truck1 s0)
   deleted: (driving driver4 truck1)
   added: (at driver4 s0) (empty truck1)
   goals met: 2 of 6
10. (board-truck driver2 truck1 s0)
   deleted: (at driver2 s0) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 2 of 6
11. (drive-truck truck1 s0 s4 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (fuel-used) from 1856 to 2610
   goals met: 2 of 6
12. (unload-truck package1 truck1 s4)
   deleted: (in package1 truck1)
   added: (at package1 s4)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 3 of 6
13. (walk driver3 s3 p5-3)
   deleted: (at driver3 s3)
   added: (at driver3 p5-3)
   goals met: 3 of 6
14. (drive-truck truck1 s4 s2 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (fuel-used) from 2610 to 3325
   goals met: 3 of 6
15. (walk driver3 p5-3 s5)
   deleted: (at driver3 p5-3)
   added: (at driver3 s5)
   goals met: 3 of 6
16. (walk driver3 s5 p5-2)
   deleted: (at driver3 s5)
   added: (at driver3 p5-2)
   goals met: 3 of 6
17. (walk driver3 p5-2 s2)
   deleted: (at driver3 p5-2)
   added: (at driver3 s2)
   goals met: 4 of 6
18. (drive-truck truck1 s2 s1 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 3325 to 4194
   goals met: 4 of 6
19. (unload-truck package3 truck1 s1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 5 of 6
20. (drive-truck truck1 s1 s2 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (fuel-used) from 4194 to 4984
   goals met: 5 of 6
21. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 6 of 6
